name: "yolov8_tracking"
backend: "python"
max_batch_size: 1
input [
  {
    name: "INPUT"
    data_type: TYPE_FP8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "BBX"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  },
  {
    name: "SCORE"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  },
  {
    name: "CLASS"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
    label_filename: "yolov5_class.txt"
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]